In [2]:
import pandas as pd
from io import StringIO

data = """id	first_name	last_name	salary	department_id	first_last
1	Todd	Wilson	110000	1006	ToddWilson
1	Todd	Wilson	106119	1006	ToddWilson
2	Justin	Simon	128922	1005	JustinSimon
2	Justin	Simon	130000	1005	JustinSimon
3	Kelly	Rosario	42689	1002	KellyRosario
4	Patricia	Powell	162825	1004	PatriciaPowell
4	Patricia	Powell	170000	1004	PatriciaPowell
5	Sherry	Golden	44101	1002	SherryGolden
6	Natasha	Swanson	79632	1005	NatashaSwanson
6	Natasha	Swanson	90000	1005	NatashaSwanson
7	Diane	Gordon	74591	1002	DianeGordon
8	Mercedes	Rodriguez	61048	1005	MercedesRodriguez
9	Christy	Mitchell	137236	1001	ChristyMitchell
9	Christy	Mitchell	140000	1001	ChristyMitchell
9	Christy	Mitchell	150000	1001	ChristyMitchell
10	Sean	Crawford	182065	1006	SeanCrawford
10	Sean	Crawford	190000	1006	SeanCrawford
"""

df = pd.read_csv(StringIO(data), sep="\t")

df.head()

   id first_name last_name  salary  department_id    first_last
0   1       Todd    Wilson  110000           1006    ToddWilson
1   1       Todd    Wilson  106119           1006    ToddWilson
2   2     Justin     Simon  128922           1005   JustinSimon
3   2     Justin     Simon  130000           1005   JustinSimon
4   3      Kelly   Rosario   42689           1002  KellyRosario

In [5]:
df_updated = df.groupby(["id","first_name","last_name","department_id"],as_index= False)["salary"].max()

In [7]:
import pandas as pd

airbnb_search_details = pd.DataFrame({
    "id": [1, 2, 3, 4, 5, 6, 7, 8],
    "city": ["NYC", "NYC", "NYC", "LA", "LA", "SF", "SF", "SF"],
    "property_type": [
        "Apartment", "Apartment", "House",
        "Apartment", "Villa",
        "Apartment", "House", "House"
    ],
    "bathrooms": [1, 2, 1, 2, 3, 1, 2, 3],
    "bedrooms": [1, 2, 2, 1, 4, 1, 3, 2]
})

In [23]:
airbnb_search_details.groupby(["city","property_type"],as_index= False).agg("mean")

  city property_type   id  bathrooms  bedrooms
0   LA     Apartment  4.0        2.0       1.0
1   LA         Villa  5.0        3.0       4.0
2  NYC     Apartment  1.5        1.5       1.5
3  NYC         House  3.0        1.0       2.0
4   SF     Apartment  6.0        1.0       1.0
5   SF         House  7.5        2.5       2.5

In [24]:
airbnb_search_details

   id city property_type  bathrooms  bedrooms
0   1  NYC     Apartment          1         1
1   2  NYC     Apartment          2         2
2   3  NYC         House          1         2
3   4   LA     Apartment          2         1
4   5   LA         Villa          3         4
5   6   SF     Apartment          1         1
6   7   SF         House          2         3
7   8   SF         House          3         2

In [19]:
airbnb_search_details.groupby("city").agg({
    "bathrooms": "mean",
    "bedrooms": "max"
})

      bathrooms  bedrooms
city
LA     2.500000         4
NYC    1.333333         2
SF     2.000000         3

In [21]:
airbnb_search_details.groupby(["city", "property_type"], as_index=False).agg("mean")

  city property_type   id  bathrooms  bedrooms
0   LA     Apartment  4.0        2.0       1.0
1   LA         Villa  5.0        3.0       4.0
2  NYC     Apartment  1.5        1.5       1.5
3  NYC         House  3.0        1.0       2.0
4   SF     Apartment  6.0        1.0       1.0
5   SF         House  7.5        2.5       2.5